src/cf/Documents/ИсходящееСообщение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ИсходящееСообщение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обменник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СвязиОбъектовИСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиОбъектовИСообщенийRMQ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обменник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщение</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ИсходящееСообщение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаполнитьДокументНаОснованииЗаказаКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Блюда") Тогда
		ЗаполнитьДокументНаОснованииБлюда(ДанныеЗаполнения);
	КонецЕсли;
	
	Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДокументНаОснованииЗаказаКлиента(ЗаказКлиента)
	
	Обменник = "orders";
	
	ДанныеЗаказа = Документы.ЗаказКлиента.ДанныеЗаказа(ЗаказКлиента);
	ДанныеЗаказа.Ссылка = XMLСтрока(ДанныеЗаказа.Ссылка);
	ДанныеЗаказа.Статус = XMLСтрока(ДанныеЗаказа.Статус);
	
	Для Каждого ДанныеБлюда Из ДанныеЗаказа.Блюда Цикл
		ДанныеБлюда.Блюдо = XMLСтрока(ДанныеБлюда.Блюдо);
	КонецЦикла;
	
	Запрос = Новый Структура;
	Запрос.Вставить("properties", Новый Структура);
	Запрос.Вставить("routing_key", "");
	Запрос.Вставить("payload", КоннекторHTTP.ОбъектВJson(ДанныеЗаказа));
	Запрос.Вставить("payload_encoding", "string");
	
	Тело = КоннекторHTTP.ОбъектВJson(Запрос);
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииБлюда(Блюдо)
	
	Обменник = "dishes";
	
	ДанныеБлюда = Новый Структура;
	ДанныеБлюда.Вставить("Ссылка", XMLСтрока(Блюдо));
	ДанныеБлюда.Вставить("Код", Блюдо.Код);
	ДанныеБлюда.Вставить("Наименование", Блюдо.Наименование);
	
	Запрос = Новый Структура;
	Запрос.Вставить("properties", Новый Структура);
	Запрос.Вставить("routing_key", "");
	Запрос.Вставить("payload", КоннекторHTTP.ОбъектВJson(ДанныеБлюда));
	Запрос.Вставить("payload_encoding", "string");
	
	Тело = КоннекторHTTP.ОбъектВJson(Запрос);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Объект") Тогда
		РегистрыСведений.СвязиОбъектовИСообщенийRMQ.СоздатьНовуюСвязь(ДополнительныеСвойства.Объект, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
